export {};

declare global {
    interface Date {
        /**
         * Формує представлення дати-часу:
         * - якщо дата "сьогодні", то виводиться тільки час з секундами
         * - якщо "вчора", то слово "вчора" та час без секунд
         * - якщо до тижня, то "3 дні тому" та час без секунд
         * - якщо в межах поточного року виводити тільки дату "31 грудня" та час
         * - якщо старша, то повна дата "31 грудня 2025 р" та час без секунд
         */
        pretty: () => string,
    }
}

Date.prototype.pretty = function() : string {
  return this.toLocaleString();
}